# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать
# у пользователя, предусмотреть обработку ситуации деления на ноль.

def devision(arg_1: int, arg_2: int) -> float:
    """Функция деления
    :param arg_1: int делимое
    :param arg_2: int делитель
    """
    try:
        result = arg_1 / arg_2
    except ZeroDivisionError:
        result = 'Ошибка. Невозможно деление на ноль'
        return result
    return arg_1 / arg_2


a = input('Введите первое число для деления (делимое): \n')
b = input('Введите второе число для деления (делитель): \n')
print(devision(a, b))
