# 4. Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить
# возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). При решении задания
# необходимо обойтись без встроенной функции возведения числа в степень.

# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def my_func_1(arg_1: float, arg_2: int):
    return x ** y


def my_func_2(arg_1: float, arg_2: int):
    ex = arg_1
    while arg_2 < -1:
        ex = ex * arg_1
        arg_2 += 1
    return 1 / ex


x = abs(float(input('Введите действительное положительное число x (основание степени): \n')))
y = int(input('Введите целое отрицательное число y (степень): \n'))

print(my_func_1(x, y))
print(my_func_2(x, y))
