# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия,
# год рождения, город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

name = input('Введите ваше имя: \n')
surname = input('Ваша фамилия: \n')
year = input('Год рождения: \n')
city = input('Город проживания: \n')
email = input('Адрес электронной почты: \n')
phone = input('Номер телефона: \n')


def print_profile(n: str, sn: str, y: str, c: str, e: str, p: str) -> str:
    print(f'Пользователь {n} {sn}, {y} года рождения, проживает в городе {c}, email: {e},'
          f' номер телефона: {p}')
    return


print_profile(n=name, sn=surname, y=year, c=city, e=email, p=phone)
