# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение. При вызове функции
# должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fibo_gen(). Функция
# отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

def fibo_gen(max: int):
    """
    Функция расчета факториала числа.
    :param max:
    :return:
    """
    fact = 1
    i = 1
    while i <= max:
        fact *= i
        yield fact
        i += 1


a = fibo_gen(15)
print(list(a))
