# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете
# необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета для конкретных
# значений необходимо запускать скрипт с параметрами.

import sys

rate_sal = 100
_, work_hours, award = sys.argv
work_hours = int(work_hours)
award = int(award)

print(f'Заработная плата сотрудника составляет: {(work_hours * rate_sal) + award}')
