# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не
# обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий
# по нему. Вывести словарь на экран.
# Примеры строк файла:

# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
# Пример словаря:

# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

my_list = []
result_list = []
result_dict = {}
lines = 0
with open('p_05.06.txt', 'r', encoding='UTF-8') as file:
    for line in file:
        lines += 1
        tmp = line.strip().split(' ')
        for itm in tmp:
            itm = itm.replace(':', '')
            itm = itm.replace('(л)', '')
            itm = itm.replace('(пр)', '')
            itm = itm.replace('(лаб)', '')
            itm = itm.replace('—', '0')
            my_list.append(itm)

i = 0
while lines > 0:
    result_dict[my_list[i]] = int(my_list[i+1])+int(my_list[i+2])+int(my_list[i+3])
    i += 4
    lines -= 1

print(result_dict)
