# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
# (зима, весна, лето, осень). Напишите решения через list и через dict.

while True:
    month = input('Введите порядковый номер месяца от 1 до 12: \n')
    if month.isdigit():
        month = int(month)
        break
    else:
        print('Ошибка ввода. Введите число: \n')

# Решение с использованием списка
winter = [12, 1, 2]
spring = [3, 4, 5]
summer = [6, 7, 8]
autumn = [9, 10, 11]

if month in winter:
    print('Зима (решение с использованием списка)')
elif month in spring:
    print('Весна (решение с использованием списка)')
elif month in summer:
    print('Лето (решение с использованием списка)')
elif month in autumn:
    print('Осень (решение с использованием списка)')
else:
    print('Введен неправильный порядковый номер месяца')

# Решение с использованием словаря
year_dict = {1: 'Зима', 2: 'Зима', 3: 'Весна', 4: 'Весна', 5: 'Весна', 6: 'Лето', 7: 'Лето', 8: 'Лето', 9: 'Осень',
             10: 'Осень', 11: 'Осень', 12: 'Зима'}
if 0 < month < 13:
    print(f'{year_dict[month]} (решение с использованием словаря)')
else:
    print('Введен неправильный порядковый номер месяца')

