# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.

user_string = input('Введите несколько слов, разделенных пробелами: \n')
user_string_list = user_string.split(' ')

i = 1
for itm in user_string_list:
    print(f'{i}. {itm[:10]}')
    i += 1
